#!/bin/bash

name='web-project';

d=`date "+%Y-%m-%d %H:%M:%S"`
echo "-------------------开始构建---------------------"
echo "-------------------构建时间：${d}---------------------"

echo "-------------------停止旧版容器---------------------"
docker stop ${name};
echo "-------------------删除旧版容器---------------------"
docker rm ${name};
echo "-------------------删除旧版镜像---------------------"
docker rmi ${name};
echo "-------------------构建新镜像---------------------"
docker build -t ${name} .;
echo "-------------------查看镜像---------------------"
docker images;
echo "-------------------启动容器---------------------"
docker run -d --restart=always --name web-project -p 4000:80 web-project;